#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...
import room_1, room_2
print ("In room_1 live", room_1.folks[0], "and", room_1.folks[1])
print ("In room_2 live", room_2.folks[0])
